; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v3 ?v4)
             (pred_6 ?v13 ?v5)
             (pred_2 ?v3 ?v5)
             (pred_4 ?v11 ?v3 )
	     (pred_10 ?v3)
             (pred_7 ?v7)
             (pred_12 ?v13)
             (pred_9 ?v5)
             (pred_3 ?v3)
             (pred_11 ?v13)
             (pred_1 ?v3)
             (pred_5 ))



(:action op_5
:parameters (?v1 ?v12 ?v10 ?v9)
:precondition (and (pred_7 ?v1) (pred_7 ?v12) (pred_12 ?v10) (pred_9 ?v9)
          (pred_8 ?v1 ?v12) (pred_6 ?v10 ?v9)
                   (pred_2 ?v12 ?v9) (pred_10 ?v1) 
                   (pred_3 ?v12) (pred_11 ?v10))
:effect (and  (pred_1 ?v12) (not (pred_3 ?v12))))


(:action op_2
:parameters (?v1 ?v6)
:precondition (and (pred_7 ?v1) (pred_7 ?v6)
               (pred_10 ?v1) (pred_8 ?v1 ?v6) (pred_1 ?v6))
:effect (and (pred_10 ?v6) (not (pred_10 ?v1))))

(:action op_3
:parameters (?v1 ?v10)
:precondition (and (pred_7 ?v1) (pred_12 ?v10) 
                  (pred_10 ?v1) (pred_4 ?v10 ?v1) (pred_5 ))
:effect (and (pred_11 ?v10)
   (not (pred_4 ?v10 ?v1)) (not (pred_5 ))))


(:action op_4
:parameters (?v1 ?v8 ?v2)
:precondition (and (pred_7 ?v1) (pred_12 ?v8) (pred_12 ?v2)
                  (pred_10 ?v1) (pred_11 ?v2) (pred_4 ?v8 ?v1))
:effect (and (pred_11 ?v8) (pred_4 ?v2 ?v1)
        (not (pred_11 ?v2)) (not (pred_4 ?v8 ?v1))))

(:action op_1
:parameters (?v1 ?v10)
:precondition (and (pred_7 ?v1) (pred_12 ?v10) 
                  (pred_10 ?v1) (pred_11 ?v10))
:effect (and (pred_5 ) (pred_4 ?v10 ?v1) (not (pred_11 ?v10)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_11 obj_19 obj_06 obj_08 obj_20 obj_18 obj_17 obj_01 obj_16 obj_14 obj_03 obj_15 obj_21 obj_02 obj_10
    obj_07 obj_05
    obj_13 obj_12 obj_09
    )

    (:init
       (pred_5)

       (pred_7 obj_04)
       (pred_7 obj_11)
       (pred_7 obj_19)
       (pred_7 obj_06)
       (pred_7 obj_08)
       (pred_7 obj_20)
       (pred_7 obj_18)
       (pred_7 obj_17)
       (pred_7 obj_01)
       (pred_7 obj_16)
       (pred_7 obj_14)
       (pred_7 obj_03)
       (pred_7 obj_15)
       (pred_7 obj_21)
       (pred_7 obj_02)
       (pred_7 obj_10)
       (pred_9 obj_07)
       (pred_9 obj_05)
       (pred_12 obj_13)
       (pred_12 obj_12)
       (pred_12 obj_09)

       (pred_8 obj_04 obj_08)
       (pred_8 obj_04 obj_11)
       (pred_8 obj_11 obj_20)
       (pred_8 obj_11 obj_19)
       (pred_8 obj_11 obj_04)
       (pred_8 obj_19 obj_18)
       (pred_8 obj_19 obj_06)
       (pred_8 obj_19 obj_11)
       (pred_8 obj_06 obj_17)
       (pred_8 obj_06 obj_19)
       (pred_8 obj_08 obj_01)
       (pred_8 obj_08 obj_20)
       (pred_8 obj_08 obj_04)
       (pred_8 obj_20 obj_16)
       (pred_8 obj_20 obj_18)
       (pred_8 obj_20 obj_11)
       (pred_8 obj_20 obj_08)
       (pred_8 obj_18 obj_14)
       (pred_8 obj_18 obj_17)
       (pred_8 obj_18 obj_19)
       (pred_8 obj_18 obj_20)
       (pred_8 obj_17 obj_03)
       (pred_8 obj_17 obj_06)
       (pred_8 obj_17 obj_18)
       (pred_8 obj_01 obj_15)
       (pred_8 obj_01 obj_16)
       (pred_8 obj_01 obj_08)
       (pred_8 obj_16 obj_21)
       (pred_8 obj_16 obj_14)
       (pred_8 obj_16 obj_20)
       (pred_8 obj_16 obj_01)
       (pred_8 obj_14 obj_02)
       (pred_8 obj_14 obj_03)
       (pred_8 obj_14 obj_18)
       (pred_8 obj_14 obj_16)
       (pred_8 obj_03 obj_10)
       (pred_8 obj_03 obj_17)
       (pred_8 obj_03 obj_14)
       (pred_8 obj_15 obj_21)
       (pred_8 obj_15 obj_01)
       (pred_8 obj_21 obj_02)
       (pred_8 obj_21 obj_16)
       (pred_8 obj_21 obj_15)
       (pred_8 obj_02 obj_10)
       (pred_8 obj_02 obj_14)
       (pred_8 obj_02 obj_21)
       (pred_8 obj_10 obj_03)
       (pred_8 obj_10 obj_02)
       (pred_3 obj_08)
       (pred_3 obj_21)
       (pred_3 obj_03)
       (pred_2  obj_08 obj_07)
       (pred_2  obj_21 obj_05)
       (pred_2  obj_03 obj_05)
       (pred_1 obj_04)
       (pred_1 obj_11)
       (pred_1 obj_19)
       (pred_1 obj_06)
       (pred_1 obj_20)
       (pred_1 obj_18)
       (pred_1 obj_17)
       (pred_1 obj_01)
       (pred_1 obj_16)
       (pred_1 obj_14)
       (pred_1 obj_15)
       (pred_1 obj_02)
       (pred_1 obj_10)

       (pred_6  obj_13 obj_07)
       (pred_6  obj_12 obj_05)
       (pred_6  obj_09 obj_05)
       (pred_4 obj_13 obj_19)
       (pred_4 obj_12 obj_10)
       (pred_4 obj_09 obj_08)
       (pred_10 obj_17)
    )

    (:goal (and
       (pred_4 obj_13 obj_14)
    ))
(:constraints
  (always (not (pred_10 obj_18)))
)
)

; plan
1. (op_2 obj_17 obj_06)
   deleted: (pred_10 obj_17)
   added: (pred_10 obj_06)
   goals met: 0 of 1
2. (op_2 obj_06 obj_19)
   deleted: (pred_10 obj_06)
   added: (pred_10 obj_19)
   goals met: 0 of 1
3. (op_3 obj_19 obj_13)
   deleted: (pred_4 obj_13 obj_19) (pred_5)
   added: (pred_11 obj_13)
   goals met: 0 of 1
4. (op_2 obj_19 obj_11)
   deleted: (pred_10 obj_19)
   added: (pred_10 obj_11)
   goals met: 0 of 1
5. (op_2 obj_11 obj_20)
   deleted: (pred_10 obj_11)
   added: (pred_10 obj_20)
   goals met: 0 of 1
6. (op_2 obj_20 obj_16)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_16)
   goals met: 0 of 1
7. (op_2 obj_16 obj_14)
   deleted: (pred_10 obj_16)
   added: (pred_10 obj_14)
   goals met: 0 of 1
8. (op_1 obj_14 obj_13)
   deleted: (pred_11 obj_13)
   added: (pred_5) (pred_4 obj_13 obj_14)
   goals met: 1 of 1
